README.md

# Table of Contents

1.  [Проверка прав на доступ к функциям](#org0b3aa8c)
2.  [Неочевидный код](#org983f9e0)
3.  [Ошибки с целочисленной арифметикой](#orgc6c627f)
4.  [Арифметическое переполнение](#org722d6af)
5.  [Неиспользование SafeMath при работе с числами](#orgbd6c12f)
6.  [Возможность транфера на произвольный адрес](#org2383958)
7.  [Отсутствие проверки параметров в функции доступной извне](#orgc72367a)
8.  [Привязка времени к номеру блока](#orgcb1a6a4)
9.  [Для каждой операции обычно должна быть обратная](#org1bb8cd0)
10. [Проверять соответствие стандартам](#org7970a9e)
11. [Other](#org728f4cd)

Чеклист для аудита смарт-контрактов.


<a id="org0b3aa8c"></a>

# Проверка прав на доступ к функциям

Не должно быть функций, которыми по сценарию управляет Owner, доступных
для не-owner-а и наоборот.


<a id="org983f9e0"></a>

# Неочевидный код

Как правило содержит ошибки если неясность видна с первого взгляда


<a id="orgc6c627f"></a>

# Ошибки с целочисленной арифметикой

-   Деление тоже целочисленное (если не использзовать float)
-   Деление на ноль


<a id="org722d6af"></a>

# Арифметическое переполнение

..и антипереполнение


<a id="orgbd6c12f"></a>

# Неиспользование SafeMath при работе с числами


<a id="org2383958"></a>

# Возможность транфера на произвольный адрес

Когда, например, происходит msg.sender.call. Может не быть ошибкой, если
функция с модификатором OnlyOwner.


<a id="orgc72367a"></a>

# Отсутствие проверки параметров в функции доступной извне

Проверка на диапазон или хотя бы на не-ноль.


<a id="orgcb1a6a4"></a>

# Привязка времени к номеру блока

не особо адекватное решение


<a id="org1bb8cd0"></a>

# Для каждой операции обычно должна быть обратная

Если есть депозит, должен быть вывод


<a id="org7970a9e"></a>

# Проверять соответствие стандартам

Например Бинанс имеет свой стандарт ERC-20 который требует getOwner


<a id="org728f4cd"></a>

# Other

Самое важное для проверки - это депозит и снятие

Manticore - изучить

[TODO:gmm] - Как искать флешлоаны? Смотреть, что msg.sender может быть
контрактом?

[TODO:gmm] - Просмотреть OpenZeppelin контракты
